#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ACT-Terraform-Demos/demo-github-actions/runs/run-QjB8HKkZeB6xXrVF

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
2023-01-18T05:46:46.590Z [INFO]  Terraform version: 1.3.7
2023-01-18T05:46:46.590Z [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2023-01-18T05:46:46.590Z [DEBUG] using github.com/hashicorp/hcl/v2 v2.15.0
2023-01-18T05:46:46.590Z [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2023-01-18T05:46:46.590Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2023-01-18T05:46:46.590Z [DEBUG] using github.com/zclconf/go-cty v1.12.1
2023-01-18T05:46:46.590Z [INFO]  Go runtime version: go1.19.4
2023-01-18T05:46:46.590Z [INFO]  CLI args: []string{"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/bin/terraform", "plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:46:46.590Z [DEBUG] Attempting to open CLI config file: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.terraformrc
2023-01-18T05:46:46.591Z [INFO]  Loading CLI configuration from /home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.terraformrc
2023-01-18T05:46:46.591Z [DEBUG] checking for credentials in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.terraform.d/plugins"
2023-01-18T05:46:46.591Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2023-01-18T05:46:46.592Z [DEBUG] will search for provider plugins in /home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.terraform.d/plugins
2023-01-18T05:46:46.592Z [DEBUG] ignoring non-existing provider search directory /home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.local/share/terraform/plugins
2023-01-18T05:46:46.592Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2023-01-18T05:46:46.592Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2023-01-18T05:46:46.593Z [INFO]  CLI command args: []string{"plan", "-out=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/config/terraform.tfplan", "-var-file=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/terraform.tfvars", "-detailed-exitcode", "-lock=false"}
2023-01-18T05:46:46.595Z [DEBUG] Service discovery for app.terraform.io at https://app.terraform.io/.well-known/terraform.json
2023-01-18T05:46:47.262Z [DEBUG] checking for provisioner in "."
2023-01-18T05:46:47.262Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/bin"
2023-01-18T05:46:47.262Z [DEBUG] checking for provisioner in "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/.terraform.d/plugins"
2023-01-18T05:46:47.326Z [INFO]  backend/local: starting Plan operation
2023-01-18T05:46:47.506Z [DEBUG] backend/local: Skipping interactive prompts for variables because input is disabled
2023-01-18T05:46:47.506Z [DEBUG] Building and walking validate graph
2023-01-18T05:46:47.507Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:47.507Z [DEBUG] ProviderTransformer: "random_pet.sg" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:46:47.507Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:47.507Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:47.508Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:47.526Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:46:47.529Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=64
2023-01-18T05:46:47.529Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:46:47.579Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:47.579Z
2023-01-18T05:46:47.608Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: network=unix address=/tmp/plugin655077853 timestamp=2023-01-18T05:46:47.607Z
2023-01-18T05:46:47.608Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:47.740Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:47.741Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=64
2023-01-18T05:46:47.741Z [DEBUG] provider: plugin exited
2023-01-18T05:46:47.741Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:47.742Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:47.749Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:46:47.752Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=90
2023-01-18T05:46:47.752Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:46:47.766Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:47.766Z
2023-01-18T05:46:47.796Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin366649106 network=unix timestamp=2023-01-18T05:46:47.795Z
2023-01-18T05:46:47.796Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:47.830Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:47.831Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=90
2023-01-18T05:46:47.831Z [DEBUG] provider: plugin exited
2023-01-18T05:46:47.831Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: [random_pet.sg]
2023-01-18T05:46:47.831Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
2023-01-18T05:46:47.832Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg]
2023-01-18T05:46:47.832Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web]
2023-01-18T05:46:47.832Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:46:47.832Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:46:47.832Z [DEBUG] Starting graph walk: walkValidate
2023-01-18T05:46:47.833Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:47.833Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:47.840Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:46:47.843Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=102
2023-01-18T05:46:47.843Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:46:47.857Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:47.857Z
2023-01-18T05:46:47.886Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin800360308 network=unix timestamp=2023-01-18T05:46:47.886Z
2023-01-18T05:46:47.886Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:47.918Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:47.918Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:47.925Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:46:47.928Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=114
2023-01-18T05:46:47.928Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:46:47.977Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:47.977Z
2023-01-18T05:46:48.003Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin153348960 network=unix timestamp=2023-01-18T05:46:48.003Z
2023-01-18T05:46:48.003Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:48.034Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:48.034Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=102
2023-01-18T05:46:48.034Z [DEBUG] provider: plugin exited
2023-01-18T05:46:48.185Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:46:48.185Z
2023-01-18T05:46:48.185Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:46:48.185Z
2023-01-18T05:46:48.188Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:48.189Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=114
2023-01-18T05:46:48.189Z [DEBUG] provider: plugin exited
2023-01-18T05:46:48.189Z [INFO]  backend/local: plan calling Plan
2023-01-18T05:46:48.189Z [DEBUG] Building and walking plan graph for NormalMode
2023-01-18T05:46:48.189Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:48.189Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:46:48.190Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web (expand)]
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:46:48.190Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: [random_pet.sg (expand)]
2023-01-18T05:46:48.190Z [DEBUG] Starting graph walk: walkPlan
2023-01-18T05:46:48.191Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:48.192Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:48.198Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5]
2023-01-18T05:46:48.201Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=135
2023-01-18T05:46:48.201Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5
2023-01-18T05:46:48.216Z [INFO]  provider.terraform-provider-random_v3.0.1_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:48.216Z
2023-01-18T05:46:48.244Z [DEBUG] provider.terraform-provider-random_v3.0.1_x5: plugin address: address=/tmp/plugin921620952 network=unix timestamp=2023-01-18T05:46:48.243Z
2023-01-18T05:46:48.244Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:48.276Z [DEBUG] created provider logger: level=debug
2023-01-18T05:46:48.276Z [INFO]  provider: configuring client automatic mTLS
2023-01-18T05:46:48.283Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 args=[.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5]
2023-01-18T05:46:48.286Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=147
2023-01-18T05:46:48.286Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5
2023-01-18T05:46:48.334Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: configuring server automatic mTLS: timestamp=2023-01-18T05:46:48.334Z
2023-01-18T05:46:48.361Z [DEBUG] provider.terraform-provider-aws_v3.26.0_x5: plugin address: address=/tmp/plugin905816081 network=unix timestamp=2023-01-18T05:46:48.361Z
2023-01-18T05:46:48.361Z [DEBUG] provider: using plugin: version=5
2023-01-18T05:46:48.392Z [DEBUG] ReferenceTransformer: "random_pet.sg" references: []
random_pet.sg: Refreshing state... [id=grateful-troll]
2023-01-18T05:46:48.397Z [WARN]  Provider "registry.terraform.io/hashicorp/random" produced an invalid plan for random_pet.sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .separator: planned value cty.StringVal("-") for a non-computed attribute
      - .length: planned value cty.NumberIntVal(2) for a non-computed attribute
2023-01-18T05:46:48.398Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:48.398Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/random/3.0.1/linux_amd64/terraform-provider-random_v3.0.1_x5 pid=135
2023-01-18T05:46:48.398Z [DEBUG] provider: plugin exited
2023-01-18T05:46:48.526Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/aws\"]" changed the config value, but that value is unused
2023-01-18T05:46:48.527Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [INFO] AWS Auth provider used: "EnvProvider": timestamp=2023-01-18T05:46:48.527Z
2023-01-18T05:46:48.527Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:46:48.527Z
2023-01-18T05:46:48.528Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=0ee0ecb1fc2fb332dc12efa1baff1ad4c34528a017ddb4c4dda2a657feef7f85
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T054648Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:46:48.527Z
2023-01-18T05:46:48.561Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:46:48 GMT
X-Amzn-Requestid: ffee6c43-a6c4-4730-a10a-6c6b85f0325a


-----------------------------------------------------: timestamp=2023-01-18T05:46:48.561Z
2023-01-18T05:46:48.561Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>ffee6c43-a6c4-4730-a10a-6c6b85f0325a</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:46:48.561Z
2023-01-18T05:46:48.561Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] Trying to get account information via sts:GetCallerIdentity: timestamp=2023-01-18T05:46:48.561Z
2023-01-18T05:46:48.561Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Request sts/GetCallerIdentity Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: sts.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 43
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/sts/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=0ee0ecb1fc2fb332dc12efa1baff1ad4c34528a017ddb4c4dda2a657feef7f85
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T054648Z
Accept-Encoding: gzip

Action=GetCallerIdentity&Version=2011-06-15
-----------------------------------------------------: timestamp=2023-01-18T05:46:48.561Z
2023-01-18T05:46:48.581Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Response sts/GetCallerIdentity Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 407
Content-Type: text/xml
Date: Wed, 18 Jan 2023 05:46:48 GMT
X-Amzn-Requestid: b456d8b3-0922-4ea3-9a01-5bc0046a75b8


-----------------------------------------------------: timestamp=2023-01-18T05:46:48.581Z
2023-01-18T05:46:48.581Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] <GetCallerIdentityResponse xmlns="https://sts.amazonaws.com/doc/2011-06-15/">
  <GetCallerIdentityResult>
    <Arn>arn:aws:iam::309457222015:user/cloud_user</Arn>
    <UserId>AIDAUQDIWPF73WNRR5PPF</UserId>
    <Account>309457222015</Account>
  </GetCallerIdentityResult>
  <ResponseMetadata>
    <RequestId>b456d8b3-0922-4ea3-9a01-5bc0046a75b8</RequestId>
  </ResponseMetadata>
</GetCallerIdentityResponse>: timestamp=2023-01-18T05:46:48.581Z
2023-01-18T05:46:48.583Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeAccountAttributes Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 87
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=51a8104af9b528e332fade0e6b6446826bac025ac1149750e32fd103ffce9640
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T054648Z
Accept-Encoding: gzip

Action=DescribeAccountAttributes&AttributeName.1=supported-platforms&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:46:48.582Z
2023-01-18T05:46:48.735Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeAccountAttributes Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 540
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:46:48 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: 01e1a154-b7b2-4a6f-9309-754ea99c5ea2


-----------------------------------------------------: timestamp=2023-01-18T05:46:48.735Z
2023-01-18T05:46:48.735Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeAccountAttributesResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>01e1a154-b7b2-4a6f-9309-754ea99c5ea2</requestId>
    <accountAttributeSet>
        <item>
            <attributeName>supported-platforms</attributeName>
            <attributeValueSet>
                <item>
                    <attributeValue>VPC</attributeValue>
                </item>
            </attributeValueSet>
        </item>
    </accountAttributeSet>
</DescribeAccountAttributesResponse>: timestamp=2023-01-18T05:46:48.735Z
2023-01-18T05:46:48.736Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg" references: []
aws_security_group.web-sg: Refreshing state... [id=sg-0db3602735f398c93]
2023-01-18T05:46:48.740Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Request ec2/DescribeSecurityGroups Details:
---[ REQUEST POST-SIGN ]-----------------------------
POST / HTTP/1.1
Host: ec2.us-east-1.amazonaws.com
User-Agent: aws-sdk-go/1.37.0 (go1.15.5; linux; amd64) APN/1.0 HashiCorp/1.0 Terraform/1.3.7 (+https://www.terraform.io)
Content-Length: 79
Authorization: AWS4-HMAC-SHA256 Credential=AKIAUQDIWPF747OPMC53/20230118/us-east-1/ec2/aws4_request, SignedHeaders=content-length;content-type;host;x-amz-date, Signature=660fc06bbbc2d3e94e017b0a6a6006504f6956e852859bfb4b2b926829a2b1bf
Content-Type: application/x-www-form-urlencoded; charset=utf-8
X-Amz-Date: 20230118T054648Z
Accept-Encoding: gzip

Action=DescribeSecurityGroups&GroupId.1=sg-0db3602735f398c93&Version=2016-11-15
-----------------------------------------------------: timestamp=2023-01-18T05:46:48.740Z
2023-01-18T05:46:48.820Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] DEBUG: Response ec2/DescribeSecurityGroups Details:
---[ RESPONSE ]--------------------------------------
HTTP/1.1 200 OK
Connection: close
Content-Length: 1535
Cache-Control: no-cache, no-store
Content-Type: text/xml;charset=UTF-8
Date: Wed, 18 Jan 2023 05:46:48 GMT
Keep-Alive: timeout=20
Server: AmazonEC2
Strict-Transport-Security: max-age=31536000; includeSubDomains
X-Amzn-Requestid: 75cec567-d462-4d90-9157-37ba28bf4d42


-----------------------------------------------------: timestamp=2023-01-18T05:46:48.820Z
2023-01-18T05:46:48.820Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [DEBUG] [aws-sdk-go] <?xml version="1.0" encoding="UTF-8"?>
<DescribeSecurityGroupsResponse xmlns="http://ec2.amazonaws.com/doc/2016-11-15/">
    <requestId>75cec567-d462-4d90-9157-37ba28bf4d42</requestId>
    <securityGroupInfo>
        <item>
            <ownerId>309457222015</ownerId>
            <groupId>sg-0db3602735f398c93</groupId>
            <groupName>grateful-troll-sg</groupName>
            <groupDescription>Managed by Terraform</groupDescription>
            <vpcId>vpc-0f940fc7f3bf12d87</vpcId>
            <ipPermissions>
                <item>
                    <ipProtocol>tcp</ipProtocol>
                    <fromPort>8080</fromPort>
                    <toPort>8080</toPort>
                    <groups/>
                    <ipRanges>
                        <item>
                            <cidrIp>0.0.0.0/0</cidrIp>
                        </item>
                    </ipRanges>
                    <ipv6Ranges/>
                    <prefixListIds/>
                </item>
            </ipPermissions>
            <ipPermissionsEgress>
                <item>
                    <ipProtocol>-1</ipProtocol>
                    <groups/>
                    <ipRanges>
                        <item>
                            <cidrIp>0.0.0.0/0</cidrIp>
                        </item>
                    </ipRanges>
                    <ipv6Ranges/>
                    <prefixListIds/>
                </item>
            </ipPermissionsEgress>
        </item>
    </securityGroupInfo>
</DescribeSecurityGroupsResponse>: timestamp=2023-01-18T05:46:48.820Z
2023-01-18T05:46:48.821Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_security_group.web-sg during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2023-01-18T05:46:48.823Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:46:48.823Z
2023-01-18T05:46:48.823Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:46:48.823Z
2023-01-18T05:46:48.825Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.web-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .name_prefix: planned value cty.StringVal("") for a non-computed attribute
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2023-01-18T05:46:48.826Z [DEBUG] Resource instance state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:46:48.826Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: []
2023-01-18T05:46:48.826Z [DEBUG] refresh: aws_instance.web: no state, so not refreshing
2023-01-18T05:46:48.828Z [INFO]  provider.terraform-provider-aws_v3.26.0_x5: 2023/01/18 05:46:48 [WARN] Truncating attribute path of 0 diagnostics for TypeSet: timestamp=2023-01-18T05:46:48.827Z
2023-01-18T05:46:48.830Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_instance.web, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .source_dest_check: planned value cty.True for a non-computed attribute
      - .user_data: planned value cty.StringVal("d36263b945850b1251dc22e4ed5c62aeb9e9e0f0") does not match config value cty.StringVal("#!/bin/bash\napt-get update\napt-get install -y apache2\nsed -i -e 's/80/8080/' /etc/apache2/ports.conf\necho \"Hello World\" > /var/www/html/index.html\nsystemctl restart apache2\n")
      - .get_password_data: planned value cty.False for a non-computed attribute
      - .ebs_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .enclave_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .ephemeral_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .metadata_options: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .network_interface: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .root_block_device: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2023-01-18T05:46:48.831Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2023-01-18T05:46:48.832Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/hashicorp/aws/3.26.0/linux_amd64/terraform-provider-aws_v3.26.0_x5 pid=147
2023-01-18T05:46:48.832Z [DEBUG] provider: plugin exited
2023-01-18T05:46:48.833Z [DEBUG] building apply graph to check for errors
2023-01-18T05:46:48.833Z [DEBUG] Resource state not found for node "aws_instance.web", instance aws_instance.web
2023-01-18T05:46:48.833Z [DEBUG] ProviderTransformer: "aws_instance.web (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:48.833Z [DEBUG] ProviderTransformer: "aws_security_group.web-sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:48.833Z [DEBUG] ProviderTransformer: "aws_instance.web" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/hashicorp/aws"]
2023-01-18T05:46:48.834Z [DEBUG] ProviderTransformer: "random_pet.sg (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/hashicorp/random"]
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "aws_instance.web" references: [aws_security_group.web-sg (expand)]
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/random\"]" references: []
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/hashicorp/aws\"]" references: []
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "random_pet.sg (expand)" references: []
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "aws_instance.web (expand)" references: []
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "aws_security_group.web-sg (expand)" references: []
2023-01-18T05:46:48.834Z [DEBUG] ReferenceTransformer: "output.web-address (expand)" references: [aws_instance.web aws_instance.web aws_instance.web (expand)]
2023-01-18T05:46:48.834Z [DEBUG] pruneUnusedNodes: random_pet.sg (expand) is no longer needed, removing
2023-01-18T05:46:48.834Z [DEBUG] pruneUnusedNodes: provider["registry.terraform.io/hashicorp/random"] is no longer needed, removing
2023-01-18T05:46:48.834Z [INFO]  backend/local: plan operation completed
2023-01-18T05:46:48.834Z [INFO]  backend/local: writing plan output to: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-QjB8HKkZeB6xXrVF/config/terraform.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-01625be155ee390e9"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "hvm:ebs-ssd"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0"
      + vpc_security_group_ids       = [
          + "sg-0db3602735f398c93",
        ]

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web-address = (known after apply)

```

</details>

*Pushed by: @dassiorleando, Action: `pull_request`*